2023/6-sekolah/ci4/app/Controllers/Guru.php

    public function index()
    {
        $data['guru'] = $this->guruModel->findAll();
---
SELECT *
FROM `guru`

    public function read($id)
    {
        $data['guru'] = $this->guruModel->find($id);
---
SELECT *
FROM `guru`
WHERE `guru`.`id` = '4'

    public function edit($id)
    {
        $data['guru'] = $this->guruModel->find($id);
---
SELECT *
FROM `guru`
WHERE `guru`.`id` = '4'

    public function update($id)
    {
        $data = $this->request->getPost();
        $this->guruModel->update($id, $data);
---
UPDATE `guru` SET `nama` = 'Eko Suwilyoa', `mata_pelajaran` = 'MPIa', `no_telp` = '9438403a', `updated_at` = '2024-04-21 23:35:36'
WHERE `guru`.`id` IN ('4')

    public function delete($id): RedirectResponse
    {
        $this->guruModel->delete($id);
---
DELETE FROM `guru`
WHERE `id` IN ('4')