2023/6-sekolah/ci4/app/Controllers/Nilai.php

SELECT `nilai`.*, `siswa`.`nama` as `siswa_nama`, `guru`.`nama` as `guru_nama`
FROM `nilai`
LEFT JOIN `siswa` ON `siswa`.`id` = `nilai`.`siswa_id`
LEFT JOIN `guru` ON `guru`.`id` = `nilai`.`guru_id`
SELECT *
FROM `siswa`
SELECT *
FROM `guru`
---
    public function index()
    {
        $this->nilaiModel->select('nilai.*, siswa.nama as siswa_nama, guru.nama as guru_nama');
        $this->nilaiModel->join('siswa', 'siswa.id = nilai.siswa_id', 'left');
        $this->nilaiModel->join('guru', 'guru.id = nilai.guru_id', 'left');
        $data['nilai'] = $this->nilaiModel->findAll();
        $data['siswa'] = $this->siswaModel->findAll();
        $data['guru'] = $this->guruModel->findAll();

SELECT *
FROM `siswa`
SELECT *
FROM `guru`
---
    public function create()
    {
        $data['siswa'] = $this->siswaModel->findAll();
        $data['guru'] = $this->guruModel->findAll();

INSERT INTO `nilai` (`siswa_id`, `guru_id`, `mata_pelajaran`, `nilai`, `created_at`, `updated_at`) VALUES ('3', '3', 'MPI', '32', '2024-04-21 23:37:31', '2024-04-21 23:37:31')
---
    public function store()
    {
        $data = $this->request->getPost();
        $this->nilaiModel->insert($data);

SELECT `nilai`.*, `siswa`.`nama` as `siswa_nama`, `guru`.`nama` as `guru_nama`
FROM `nilai`
JOIN `siswa` ON `siswa`.`id` = `nilai`.`siswa_id`
JOIN `guru` ON `guru`.`id` = `nilai`.`guru_id`
WHERE `nilai`.`id` = '4'
---
    public function read($id)
    {
        $this->nilaiModel->select('nilai.*, siswa.nama as siswa_nama, guru.nama as guru_nama');
        $this->nilaiModel->join('siswa', 'siswa.id = nilai.siswa_id');
        $this->nilaiModel->join('guru', 'guru.id = nilai.guru_id');
        $data['nilai'] = $this->nilaiModel->find($id);

SELECT *
FROM `nilai`
WHERE `nilai`.`id` = '4'
SELECT *
FROM `siswa`
SELECT *
FROM `guru`
---
    public function edit($id)
    {
        $data['nilai'] = $this->nilaiModel->find($id);
        $data['siswa'] = $this->siswaModel->findAll();
        $data['guru'] = $this->guruModel->findAll();

UPDATE `nilai` SET `siswa_id` = '2', `guru_id` = '1', `mata_pelajaran` = 'MPIa', `nilai` = '34', `updated_at` = '2024-04-21 23:41:01'
WHERE `nilai`.`id` IN ('4')
---
    public function update($id)
    {
        $data = $this->request->getPost();
        $this->nilaiModel->update($id, $data);

DELETE FROM `nilai`
WHERE `id` IN ('4')
---
    public function delete($id): RedirectResponse
    {
        $this->nilaiModel->delete($id);